Revit 2027 API
AnalyticalRigidLinksOption Enumeration
 Specifies how Rigid Links will be made for the Analytical Model.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AnalyticalRigidLinksOption
Public Enumeration AnalyticalRigidLinksOption
public enum class AnalyticalRigidLinksOption
type AnalyticalRigidLinksOption
Members
Member name | Value | Description
Disabled | 1 |  For a structural column, this disables rigid Link formation, unless the neighboring structural beam overrides the setting. For a structural beam, this disables rigid Link formation, overriding the neighboring structural column's setting.
Enabled | 0 |  For a structural column, enables rigid link formation, unless the neighboring structural beam overrides the setting. For a structural beam, enables rigid link formation, overriding the neighboring structural column's setting.
FromColumn | 2 |  For a structural beam, this indicates that the structural column setting should be used to determine rigid link formation. This value is not applicable to structural columns.
Remarks
 Rigid Links are curves connecting neighboring Structural Beams and Structural Columns.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace